gestao_estoque/app/controllers/estoques_controller.rb

SELECT "estoques".* FROM "estoques"
---
  def index
    @estoques = Estoque.all

SELECT "estoques".* FROM "estoques" WHERE "estoques"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_estoque
      @estoque = Estoque.find(params[:id])