gestao_estoque/app/controllers/funcionarios_controller.rb

  def index
    @funcionarios = Funcionario.all
---
SELECT "funcionarios".* FROM "funcionarios"