gestao_estoque/app/controllers/historicos_controller.rb

SELECT "historicos".* FROM "historicos"
---
  def index
    @historicos = Historico.all

SELECT "historicos".* FROM "historicos" WHERE "historicos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_historico
      @historico = Historico.find(params[:id])